app/views/visits/new.html.erb

      <%= f.select(:duration_id) do %>
        <% Duration.all.each do |d| %>
---
SELECT "durations".* FROM "durations"