app/views/favorite_animals/index.html.erb

            <a href="#!" class="secondary-content"><i class="material-icons">pets</i></a>
            <% if current_user && current_user.visit_animals.include?(animal)  %>
---
SELECT  1 AS one FROM "animals" INNER JOIN "favorites" ON "animals"."id" = "favorites"."animal_id" WHERE "favorites"."user_id" = $1 AND "animals"."id" = $2 LIMIT 1  [["user_id", 1], ["id", 1]]