app/controllers/animals_controller.rb

SELECT "animals".* FROM "animals" WHERE "animals"."available" = $1  [["available", "t"]]
---
  def index
    @animals = Animal.where(available: true)

SELECT  "animals".* FROM "animals" WHERE "animals"."species_id" IN (SELECT "species"."id" FROM "species" WHERE "species"."name" = $1) LIMIT 5  [["name", "dogs"]]
---
  def home
    @dogs = Animal.where(species: Species.where(name: "dogs")).take(4)