app/controllers/cart_animals_controller.rb

SELECT  "animals".* FROM "animals" WHERE "animals"."id" = $1 LIMIT 1  [["id", 1]]
---
  def create
    animal = Animal.find(params[:animal_id])

SELECT  "animals".* FROM "animals" WHERE "animals"."id" = $1 LIMIT 1  [["id", 1]]
---
  def index
    @animals = Animal.find(@cart.contents.keys)

SELECT  "animals".* FROM "animals" WHERE "animals"."id" = $1 LIMIT 1  [["id", 1]]
---
  def destroy
    animal = Animal.find(params[:id])