app/controllers/favorite_animals_controller.rb

  def create
    animal = Animal.find(params[:animal_id])
---
SELECT  "animals".* FROM "animals" WHERE "animals"."id" = $1 LIMIT 1  [["id", 1]]

  def index
    @animals = Animal.find(@favorite.contents.keys)
---
SELECT  "animals".* FROM "animals" WHERE "animals"."id" = $1 LIMIT 1  [["id", 11]]

  def destroy
    animal = Animal.find(params[:id])
---
SELECT  "animals".* FROM "animals" WHERE "animals"."id" = $1 LIMIT 1  [["id", 11]]