app/controllers/species_controller.rb

  def show
    @species = Species.find_by(name: params[:type])
---
SELECT  "species".* FROM "species" WHERE "species"."name" = $1 LIMIT 1  [["name", "google"]]