app/controllers/visit_animals_controller.rb

  def create
    visit = Visit.new(animal: @animal, user: current_user)
    if total < 4
      if visit.save
---
INSERT INTO "visits" ("animal_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["animal_id", 1], ["user_id", 1], ["created_at", "2016-04-21 13:21:03.657721"], ["updated_at", "2016-04-21 13:21:03.657721"]]

  def destroy
    Visit.where(animal_id: @animal.id, user_id: current_user.id).first.destroy
---
DELETE FROM "visits" WHERE "visits"."id" = $1  [["id", 1]]
SELECT  "visits".* FROM "visits" WHERE "visits"."animal_id" = $1 AND "visits"."user_id" = $2  ORDER BY "visits"."id" ASC LIMIT 1  [["animal_id", 1], ["user_id", 1]]

  def set_animal
    @animal = Animal.find(params[:animal_id] || params[:id])
---
SELECT  "animals".* FROM "animals" WHERE "animals"."id" = $1 LIMIT 1  [["id", nil]]