app/controllers/visits_controller.rb

  def new
    @visitation
    @visit = Visit.new
    @animals = Animal.find(@visitation.contents.keys.map(&:to_i))
---
SELECT "animals".* FROM "animals" WHERE "animals"."id" IN (5, 2)